Repository: CofficLab/Lumi
Catalog: Packages/PluginComputerUse/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: A macOS input event could not be created.
zh_hans: 无法创建 macOS 输入事件。
zh_hk: 無法建立 macOS 輸入事件。

source: Accessibility
zh_hans: 辅助功能
zh_hk: 輔助功能

source: Accessibility permission is required. Open Lumi Settings > Computer Use.
zh_hans: 需要辅助功能权限。请打开 Lumi 设置 > Computer Use。
zh_hk: 需要輔助功能權限。請開啟 Lumi 設定 > Computer Use。

source: Allowed Applications
zh_hans: 已允许的应用
zh_hk: 已允許的應用程式

source: Allows Lumi to capture the selected application window.
zh_hans: 允许 Lumi 捕获所选应用的窗口。
zh_hk: 允許 Lumi 擷取所選應用程式的視窗。

source: Allows Lumi to click, type, scroll, and navigate.
zh_hans: 允许 Lumi 点击、输入、滚动与导航。
zh_hk: 允許 Lumi 點擊、輸入、捲動與導覽。

source: Computer Use captures only the selected window. Password fields are blocked, stale screenshot coordinates are rejected, and state-changing batches require approval in Build mode.
zh_hans: Computer Use 仅捕获所选窗口。密码输入框会被屏蔽，过时的截图坐标会被拒绝，而改变状态的批量操作需在 Build 模式下获得批准。
zh_hk: Computer Use 僅擷取所選視窗。密碼輸入欄會被封鎖，過時的截圖座標會被拒絕，而改變狀態的批次操作需在 Build 模式下獲得批准。

source: Computer Use requires a model that supports both vision and tools. Select a compatible model and try again.
zh_hans: Computer Use 需要使用同时支持视觉与工具的模型。请选择兼容的模型后重试。
zh_hk: Computer Use 需要使用同時支援視覺與工具的模型。請選擇相容的模型後重試。

source: Control of {app} is not allowed. Add it under Lumi Settings > Computer Use.
zh_hans: 不允许控制 {app}。请在 Lumi 设置 > Computer Use 中添加。
zh_hk: 不允許控制 {app}。請在 Lumi 設定 > Computer Use 中加入。

source: Grant Access
zh_hans: 授予权限
zh_hk: 授予權限

source: Invalid Computer Use arguments: {message}
zh_hans: Computer Use 参数无效：{message}
zh_hk: Computer Use 參數無效：{message}

source: No matching on-screen application window was found.
zh_hans: 未找到匹配的屏幕应用窗口。
zh_hk: 未找到相符的螢幕應用程式視窗。

source: Screen Recording
zh_hans: 屏幕录制
zh_hk: 螢幕錄製

source: Screen Recording permission is required. Open Lumi Settings > Computer Use.
zh_hans: 需要屏幕录制权限。请打开 Lumi 设置 > Computer Use。
zh_hk: 需要螢幕錄製權限。請開啟 Lumi 設定 > Computer Use。

source: System Permissions
zh_hans: 系统权限
zh_hk: 系統權限

source: The observation does not exist. Call computer_observe again.
zh_hans: 该观察结果不存在。请再次调用 computer_observe。
zh_hk: 該觀察結果不存在。請再次呼叫 computer_observe。

source: The target window changed since the screenshot was captured. Call computer_observe again.
zh_hans: 截图捕获后目标窗口已发生变化。请再次调用 computer_observe。
zh_hk: 截圖擷取後目標視窗已變更。請再次呼叫 computer_observe。

source: The target window could not be captured.
zh_hans: 无法捕获目标窗口。
zh_hk: 無法擷取目標視窗。

source: Typing into a secure text field is blocked.
zh_hans: 已阻止在安全的文本输入框中键入。
zh_hk: 已阻擋在安全的文字輸入框中鍵入。

source: Allow Lumi to operate your computer?
zh_hans: 允许 Lumi 操作电脑？
zh_hk: 允許 Lumi 操作電腦？

source: Preparing to operate {app}
zh_hans: 即将操作 {app}
zh_hk: 即將操作 {app}

source: Lumi is operating {app}
zh_hans: Lumi 正在操作 {app}
zh_hk: Lumi 正在操作 {app}

source: Computer operation paused
zh_hans: 电脑操作已暂停
zh_hk: 電腦操作已暫停

source: Computer operation finished
zh_hans: 电脑操作已结束
zh_hk: 電腦操作已結束

source: Allow and Continue
zh_hans: 允许并继续
zh_hk: 允許並繼續

source: Continue Operation
zh_hans: 继续操作
zh_hk: 繼續操作

source: Not Now
zh_hans: 暂不允许
zh_hk: 暫不允許

source: Stop Operation
zh_hans: 停止操作
zh_hk: 停止操作

source: This step uses your mouse and keyboard. Permission is remembered for this app. You can stop at any time.
zh_hans: 此步骤需要使用当前电脑的鼠标和键盘。允许后会记住此应用；你可以随时停止。
zh_hk: 此步驟需要使用目前電腦的滑鼠和鍵盤。允許後會記住此應用程式；你可以隨時停止。

source: {progress} · Please pause mouse and keyboard use. Your input pauses Lumi. Press ⌘⇧Esc to stop.
zh_hans: {progress} · 请暂时不要使用鼠标和键盘。你开始操作时，Lumi 会暂停。按 ⌘⇧Esc 停止。
zh_hk: {progress} · 請暫時不要使用滑鼠和鍵盤。你開始操作時，Lumi 會暫停。按 ⌘⇧Esc 停止。

source: You can use your computer. Continuing checks the screen again without replaying earlier clicks.
zh_hans: 你可以继续使用电脑。选择继续后，Lumi 会重新检查界面，不会重放之前的点击。
zh_hk: 你可以繼續使用電腦。選擇繼續後，Lumi 會重新檢查介面，不會重播之前的點擊。

source: You can use your computer.
zh_hans: 你可以继续使用电脑。
zh_hk: 你可以繼續使用電腦。

source: Starting in {seconds} seconds
zh_hans: {seconds} 秒后开始
zh_hk: {seconds} 秒後開始

source: Step {current} of {total}
zh_hans: 正在执行第 {current}/{total} 步
zh_hk: 正在執行第 {current}/{total} 步

source: Read Application Controls
zh_hans: 读取应用控件
zh_hk: 讀取應用程式控制項

source: Operate Application Control
zh_hans: 操作应用控件
zh_hk: 操作應用程式控制項

source: Mouse and Keyboard Control
zh_hans: 鼠标和键盘操作
zh_hk: 滑鼠和鍵盤操作

source: Lumi asks you to pause while it operates. Your input pauses the operation.
zh_hans: Lumi 操作时会提示你暂时等待。你开始使用鼠标或键盘时，操作会暂停。
zh_hk: Lumi 操作時會提示你暫時等待。你開始使用滑鼠或鍵盤時，操作會暫停。

source: Ask Next Time
zh_hans: 下次询问
zh_hk: 下次詢問
